app/Controllers/Producto_controller.php

     public function listadoP_index()
{
    $datos['titulo'] = 'listadoP';


    $productModel = new \App\Models\Productos();


    $products = $productModel->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `id` ASC